Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
le_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-auudf51p4c-zjwczl-ANY]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.svep[0].aws_api_gateway_integration_response.qcnotes-get: Refreshing state... [id=agir-pihbmfom84-5yb9hf-GET-200]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-auudf51p4c-zjwczl-ANY-200]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-auudf51p4c-6bnaby-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-auudf51p4c-nftwai-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-pgsebc-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-auudf51p4c-pgsebc-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-auudf51p4c-j0sm1h-GET]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-auudf51p4c-6bnaby-POST]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-1yp0in-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-nftwai-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-auudf51p4c-1yp0in-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-auudf51p4c-q1jifp-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-auudf51p4c-j0sm1h-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-auudf51p4c-q1jifp-POST]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-auudf51p4c-nftwai-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-auudf51p4c-j0sm1h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-auudf51p4c-6bnaby-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-pgsebc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-auudf51p4c-pgsebc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-nftwai-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-auudf51p4c-1yp0in-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-1yp0in-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-auudf51p4c-6bnaby-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-auudf51p4c-j0sm1h-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-auudf51p4c-q1jifp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-auudf51p4c-q1jifp-POST-200]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-3vivi6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-auudf51p4c-fyhv7o-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-jnmq3v-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-auudf51p4c-y5t5hi-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-auudf51p4c-3vivi6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-ubnq59-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-tx4nza-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-auudf51p4c-fyhv7o-GET]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-auudf51p4c-o1bur6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-auudf51p4c-tx4nza-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-auudf51p4c-jnmq3v-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-auudf51p4c-ubnq59-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-y5t5hi-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-auudf51p4c-o1bur6-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-19r55o-POST]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-auudf51p4c-budf3y-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-auudf51p4c-19r55o-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-auudf51p4c-3n9fhg-GET]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-auudf51p4c-budf3y-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-zajmnx-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-auudf51p4c-3n9fhg-POST]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-auudf51p4c-zajmnx-GET]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-ho1m5d-POST]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-auudf51p4c-3o2mt5-GET]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-auudf51p4c-3o2mt5-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-a62i9b-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-auudf51p4c-a62i9b-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-auudf51p4c-vxkjof-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-vxkjof-POST]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-auudf51p4c-1q0gx4-POST]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-auudf51p4c-1q0gx4-GET]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-yoq0wr-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-vqjww2-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-auudf51p4c-ho1m5d-GET]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-auudf51p4c-j5giw6-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-auudf51p4c-yoq0wr-GET]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-auudf51p4c-j5giw6-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-auudf51p4c-kga52w-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-auudf51p4c-vqjww2-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-auudf51p4c-kga52w-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-3jtaho-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-facarh-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-auudf51p4c-sjks3s-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-nb8c7s-POST]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-auudf51p4c-u79iwd-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-auudf51p4c-3jtaho-GET]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-auudf51p4c-u79iwd-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-auudf51p4c-sjks3s-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-auudf51p4c-nb8c7s-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-auudf51p4c-facarh-GET]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-auudf51p4c-3vivi6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-3vivi6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-auudf51p4c-y5t5hi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-auudf51p4c-fyhv7o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-jnmq3v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-ubnq59-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-auudf51p4c-fyhv7o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-auudf51p4c-o1bur6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-tx4nza-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-y5t5hi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-auudf51p4c-tx4nza-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-auudf51p4c-o1bur6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-auudf51p4c-jnmq3v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-auudf51p4c-ubnq59-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-19r55o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-auudf51p4c-budf3y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-zajmnx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-auudf51p4c-3n9fhg-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-auudf51p4c-zajmnx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-auudf51p4c-3o2mt5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-auudf51p4c-3o2mt5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-auudf51p4c-a62i9b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-a62i9b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-auudf51p4c-vxkjof-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-vxkjof-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-auudf51p4c-1q0gx4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-vqjww2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-auudf51p4c-budf3y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-auudf51p4c-yoq0wr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-yoq0wr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-auudf51p4c-j5giw6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-auudf51p4c-vqjww2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-auudf51p4c-kga52w-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-3jtaho-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-facarh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-auudf51p4c-3n9fhg-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-nb8c7s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-auudf51p4c-j5giw6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-auudf51p4c-kga52w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-auudf51p4c-3jtaho-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-auudf51p4c-u79iwd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-auudf51p4c-sjks3s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-auudf51p4c-nb8c7s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-auudf51p4c-19r55o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-ho1m5d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-auudf51p4c-u79iwd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-auudf51p4c-facarh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-auudf51p4c-sjks3s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-auudf51p4c-1q0gx4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-auudf51p4c-ho1m5d-GET-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=axo133]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-auudf51p4c-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=auudf51p4c-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1ACA5WT51ELER]
module.svep[0].aws_api_gateway_deployment.VPApi: Refreshing state... [id=3trr1a]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-pihbmfom84-prod]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=pihbmfom84-prod-*/*]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2VOWED91CBL3B]
module.gaspifs.null_resource.gaspifs-upload: Refreshing state... [id=4307977406022670611]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=b8634475-d812-42ad-9dde-cd31725a80cb]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E8Z5K385KM143]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=4144518607]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=ba70017e-e569-6054-eaf2-9a376faeaf97]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250513021738584800000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Still reading... [1m30s elapsed]
module.webgui.data.external.build: Read complete after 1m32s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=7501596788654961346]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=4857698419747107289]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:953f9052efb3fa3bf1b716d69867dbea402c36c4da1a873757e5075e94d39f10460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:953f9052efb3fa3bf1b716d69867dbea402c36c4da1a873757e5075e94d39f10" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:686ee8c7519980d34d60d3e4c2641a3523566ec81f3a629075eeb44136783a85460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:686ee8c7519980d34d60d3e4c2641a3523566ec81f3a629075eeb44136783a85" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:54ca388cd09a38ca7a5ddbcf38d715f9aa7b8e5f41be7729437adfffbc65b91c460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:54ca388cd09a38ca7a5ddbcf38d715f9aa7b8e5f41be7729437adfffbc65b91c" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114305_00007_kyyg6" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/analyses/" -> "s3://gasi-metadata-20250513021731641000000004/analyses"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114305_00039_7f2be" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/biosamples/" -> "s3://gasi-metadata-20250513021731641000000004/biosamples"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (22 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114304_00079_5c442" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_assemblyid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/datasets/" -> "s3://gasi-metadata-20250513021731641000000004/datasets"
          - number_of_buckets         = 10 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114305_00087_xn5q7" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/individuals/" -> "s3://gasi-metadata-20250513021731641000000004/individuals"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114311_00031_e6hvr" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "individualid",
              - "biosampleid",
              - "runid",
              - "analysisid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/relations/" -> "s3://gasi-metadata-20250513021731641000000004/relations"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250924_114305_00023_qc9dk" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/runs/" -> "s3://gasi-metadata-20250513021731641000000004/runs"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:15" -> (known after apply)
      ~ code_sha256                 = "qMFayWHFm86m1pXzrioWdKCGQE40dS5yUA29SbHA/t0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-23T03:23:56.190+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:15" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "gf+k9RbENqHUtv+ew0ARPOTAUZadBWy8NbSc7GVu24nS2cJrJM1SAIiL8U4LLwF8SceB8wDtTr/y85I2wnZV0g==" -> "HHpiH1Lpszi7OcYbLIbsgGVvytLkQIl0FnK4tR3LNgrgPplDOHUb7pQHkSJ3xjNWqoXuR5EpB2pxYwvmoItBgA==" # forces replacement
      ~ source_code_size            = 18449813 -> (known after apply)
      ~ version                     = "15" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gasi-dataportal-20250513021720562800000002"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16" -> (known after apply)
      ~ code_sha256                 = "DIJMGhiaqfW7pvSst0frR0e4kXnotWLk/8+SrUl9UcU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-23T03:23:59.296+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "n0y+Dbks4JhpT5Vx2Ho50pkf9FWLY7bymB4gDdaF9Yv4dc9G5voZkK8MSPXmfjJlMUnSvMSSPtK3PB4UFdcytg==" -> "ys3YJ4YVy/vSBrsUP/eqGf//tCreRzol9xm2WqSgJ8i/WXZgUl92j2migQzURK0HlOZU1zvAwOE3Cv2kSsuyDQ==" # forces replacement
      ~ source_code_size            = 17976009 -> (known after apply)
      ~ version                     = "16" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      + content                       = "v1.1.0-78-geb601524+"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "4857698419747107289" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "c7dc98f1636d6f0a6899785302a3146a8459d550" -> "e4a9fedded624f503accebfbee17fd48914c8c11"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "7501596788654961346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "c7dc98f1636d6f0a6899785302a3146a8459d550" -> "e4a9fedded624f503accebfbee17fd48914c8c11"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "ba70017e-e569-6054-eaf2-9a376faeaf97" -> (known after apply)
      ~ triggers_replace = [
          ~ "" -> "v1.1.0-78-geb601524+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4870139584108961504" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615132430706000" -> "1758769552729534000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4281836413529953894" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615132533057000" -> "1758769552524540000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7698557731963202016" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615132551448200" -> "1758769552742746200"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6222856275428426842" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131253023000" -> "1758769552619736000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6642922900757781851" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131077115000" -> "1758769555155482000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "2b590136054040a209dc181be2d874b06b413d73"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:5c7cc71941f5bdaca7dfd985b9fd7982c3bea8d5ea27c874796b1f91fe5cba41" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:5c7cc71941f5bdaca7dfd985b9fd7982c3bea8d5ea27c874796b1f91fe5cba41" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "de6d95b600c3e5c2c5d347b108c99f6eb59fb7c9" -> "2b590136054040a209dc181be2d874b06b413d73"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/861136ecf53d65f1b36841796fa6301370503d1e65bb75780f1b68ec59d9875c.zip" -> "builds/18554d9293f908208d0704d60a3d8a3d530d7fde187c2f68976b4c52049ffa76.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-23T08:15:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/18554d9293f908208d0704d60a3d8a3d530d7fde187c2f68976b4c52049ffa76.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/18554d9293f908208d0704d60a3d8a3d530d7fde187c2f68976b4c52049ffa76.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2057472220352516781" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/861136ecf53d65f1b36841796fa6301370503d1e65bb75780f1b68ec59d9875c.zip" -> "builds/18554d9293f908208d0704d60a3d8a3d530d7fde187c2f68976b4c52049ffa76.zip"
          ~ "timestamp" = "1758615130754100000" -> "1758769555313202000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/6103e511dc4d471221cc34e263a98b2812c17bd33ba20f9756ecdaf0f5950942.zip" -> "builds/8357614dcbff0b867fac68a7040cb335afd690ee25f8c6bef58ce9cedd8e36c1.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-09-23T08:16:40.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8357614dcbff0b867fac68a7040cb335afd690ee25f8c6bef58ce9cedd8e36c1.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8357614dcbff0b867fac68a7040cb335afd690ee25f8c6bef58ce9cedd8e36c1.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4871526967848938305" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6103e511dc4d471221cc34e263a98b2812c17bd33ba20f9756ecdaf0f5950942.zip" -> "builds/8357614dcbff0b867fac68a7040cb335afd690ee25f8c6bef58ce9cedd8e36c1.zip"
          ~ "timestamp" = "1758615131032845000" -> "1758769555020829000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1045753270240937201" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131880748000" -> "1758769555152451000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7734434347275652118" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615132430088000" -> "1758769553111313200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/52e411fd7f12ac5bd584f8e5ea491f5cf1fe84c292c993393ab51989d07a9f8a.zip" -> "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-09-23T08:15:48.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "17191010871827685" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/52e411fd7f12ac5bd584f8e5ea491f5cf1fe84c292c993393ab51989d07a9f8a.zip" -> "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.zip"
          ~ "timestamp" = "1758615131882933000" -> "1758769553385193200"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3206953703353504342" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131626327000" -> "1758769552764313000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8601037543474267967" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131662252000" -> "1758769553261807000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8799881511156536492" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615130866425000" -> "1758769554952780000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a2982195077c9ecc287f29d99dcc56458851244621fb1b70d3bed7c4079d080e.zip" -> "builds/080b5a62d4eb6735844cf439f3b35e3aa3be35e3efef77f8bbc89652e6e88a46.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-23T08:16:07.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/080b5a62d4eb6735844cf439f3b35e3aa3be35e3efef77f8bbc89652e6e88a46.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/080b5a62d4eb6735844cf439f3b35e3aa3be35e3efef77f8bbc89652e6e88a46.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2552850478466801094" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a2982195077c9ecc287f29d99dcc56458851244621fb1b70d3bed7c4079d080e.zip" -> "builds/080b5a62d4eb6735844cf439f3b35e3aa3be35e3efef77f8bbc89652e6e88a46.zip"
          ~ "timestamp" = "1758615130757608800" -> "1758769553338660000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4795474997792732691" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131927857000" -> "1758769555260025000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_pyth
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.